[MZAllCreation X2AbilityTemplate]
LocFriendlyName="All Creation"
LocLongDescription="Draw upon the power of nature to attack every visible enemy. Causes additional effects depending on the biome."
LocHelpText="Draw upon the power of nature to attack every visible enemy. Causes additional effects depending on the biome."
LocFlyOverText="All Creation"
LocPromotionPopupText="<Bullet/> In TUNDRA biome: Inflicts bitterfrost.<br/><Bullet/> In TEMPERATE biome: Inflicts blind. <br/><Bullet/> In ARID biome: Inflicts burning. <br/><Bullet/> In URBAN Biome: Inflicts knockback. <br/><Bullet/> UNDERGROUND: Hits twice. <br/><Bullet/> In XENOFORM biome: Inflicts poison and zombify.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Has <Ability:SELFCHARGES/> uses per mission. (If 0, is not limited by charges)."

[MZAngrySky X2AbilityTemplate]
LocFriendlyName="Raging Sky"
LocLongDescription="Invoke nature's wrath against Urban blight, inflicting electrical damage in a target area."
LocHelpText="Invoke nature's wrath against Urban blight, inflicting electrical damage in a target area."
LocFlyOverText="Raging Sky"
LocPromotionPopupText="<Bullet/> Can only be used in the URBAN Biome.<br/><Bullet/> Deals electrical damage and inflicts disorient on enemies in a small area.<br/><Bullet/> Robotic foes will be stunned instead.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZArcticBreath X2AbilityTemplate]
LocFriendlyName="Arctic Breath"
LocLongDescription="Exhale freezing mist in a cone. Inflicts cold damage and bitterfrost."
LocHelpText="Exhale freezing mist in a cone. Inflicts cold damage and bitterfrost."
LocFlyOverText="Arctic Breath"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZAvalanche X2AbilityTemplate]
LocFriendlyName="Avalanche"
LocLongDescription="Draw upon the power of the Tundra, inflicting cold damage and bitterfrost in a target area."
LocHelpText="Draw upon the power of the Tundra, inflicting cold damage and bitterfrost in a target area."
LocFlyOverText="Avalanche"
LocPromotionPopupText="<Bullet/> Can only be used in the TUNDRA Biome.<br/><Bullet/> Deals cold damage and inflicts bitterfrost on enemies in a small area.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZBlindingCold X2AbilityTemplate]
LocFriendlyName="Blinding Cold"
LocHelpText="Inflict Blind and Bitterfrost on a single target."
LocLongDescription="Inflict Blind and Bitterfrost on a single target."
LocFlyOverText="Blinding Cold"
LocMissMessage="Blinding Cold resisted!"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZBloodChill X2AbilityTemplate]
LocFriendlyName="Bloodchill"
LocLongDescription="Consume <Ability:SelfHealthCost/> HP to inflict bitterfrost and blood curse."
LocHelpText="Consume <Ability:SelfHealthCost/> HP to inflict bitterfrost and blood curse."
LocFlyOverText="Bloodchill"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZBoil X2AbilityTemplate]
LocFriendlyName="Boil"
LocLongDescription="Consume chill effects to boil a target alive. Deals fire damage and inflicts burning."
LocHelpText="Consume chill effects on target to deal fire damage and inflict burning."
LocFlyOverText="Boil"
LocPromotionPopupText="<Bullet/> Can only be used on a target that is already chilled.<br/><Bullet/> Will consume all frost debuffs on hit.<br/><Bullet/> Inflicts burning on surviving foes.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZBrainFreeze X2AbilityTemplate]
LocFriendlyName="Brain Freeze"
LocLongDescription="Freeze a target's mind from the inside out. Applies a degree of bitterfrost depending on a contest of wills."
LocHelpText="Freeze a target's mind from the inside out. Applies a degree of bitterfrost depending on a contest of wills."
LocFlyOverText="Brain Freeze"
LocPromotionPopupText="<Bullet/> Always Chills, and may also inflict Bitter Chill and Freeze depending on the stat contest.<br/><Bullet/> The result largely ignores the target's current chill degree, so it may be wise to lead with this against foes you want to lock down. <br/><Bullet/> As a mental attack, robotic foes and the lost are typically immune.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZBrittleIce X2AbilityTemplate]
LocFriendlyName="Brittle Ice"
LocLongDescription="Attacks against chilled foes shred armour. Effectiveness increases with chill tier."
LocHelpText="Attacks against chilled foes shred armour. Effectiveness increases with chill tier."
LocFlyOverText="Brittle Ice"

[MZChilblains X2AbilityTemplate]
LocFriendlyName="Chilblains"
LocLongDescription="Consume <Ability:SelfHealthCost/> HP to inflict cold damage that is increased against foes that are already chilled."
LocHelpText="Consume <Ability:SelfHealthCost/> HP to deal cold damage and inflict bitterfrost and hypothermia."
LocFlyOverText="Chilblains"
LocPromotionPopupText="<Bullet/> Deals more damage the more severely chilled the target is.<br/><Bullet/> Hypothermia's damage is also increased the more severely chilled the target is.<br/><Bullet/> Maximize damage by using Chilblains against foes the are already frozen."

[MZColdShoulder X2AbilityTemplate]
LocFriendlyName="Cold Shoulder"
LocLongDescription="Immunity to Frost. Take less damage from chilled foes, and even less from bitter chilled foes."
LocHelpText="Immunity to Frost. Take less damage from chilled foes."
LocFlyOverText="Cold Shoulder"

[MZCometCracker X2AbilityTemplate]
LocFriendlyName="Comet Cracker"
LocLongDescription="Jet Pack Punch and Slam attacks stun. Slam radius is increased."
LocHelpText="Jet Pack Punch and Slam attacks stun. Slam radius is increased."
LocFlyOverText="Comet Cracker"

[MZCounterFlood X2AbilityTemplate]
LocFriendlyName="Counter Flood"
LocLongDescription="Return fire on attacks by lashing out with the power of the current biome."
LocHelpText="Return fire on attacks by lashing out with the power of the current biome."
LocFlyOverText="Counter Flood"
LocPromotionPopupText="<Bullet/> In TUNDRA biome: Inflicts bitterfrost.<br/><Bullet/> In TEMPERATE biome: Inflicts blind. <br/><Bullet/> In ARID biome: Inflicts burning. <br/><Bullet/> In URBAN Biome: Inflicts disorient, or stuns robotics. <br/><Bullet/> UNDERGROUND: Hits twice. <br/><Bullet/> In XENOFORM biome: Inflicts poison and zombify."
[MZCounterFloodShot X2AbilityTemplate]
LocFriendlyName="Counter Flood!"
LocFlyOverText="Counter Flood!"

[MZEarthSpike X2AbilityTemplate]
LocFriendlyName="Earth Spike"
LocLongDescription="Raise a pillar of earth. Damages enemies near where it emerges, and causes additional effects depending on the biome."
LocHelpText="Raise a pillar of earth. Damages enemies near where it emerges, and causes additional effects depending on the biome."
LocFlyOverText="Earth Spike"
LocPromotionPopupText="<Bullet/> The pillar can be used as full cover.<br/><Bullet/> In TUNDRA biome: Inflicts bitterfrost.<br/><Bullet/> In TEMPERATE biome: Inflicts blind. <br/><Bullet/> In ARID biome: Inflicts burning. <br/><Bullet/> In URBAN Biome: Inflicts knockback. <br/><Bullet/> UNDERGROUND: Hits twice. <br/><Bullet/> In XENOFORM biome: Inflicts poison and zombify.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZFortyBelow X2AbilityTemplate]
LocFriendlyName="Forty Below"
LocLongDescription="Cold attacks do increasingly more damage the more chilled the target is."
LocHelpText="Cold attacks do increasingly more damage the more chilled the target is."
LocFlyOverText="Forty Below"
LocPromotionPopupText="<Bullet/> Provides the maximum damage bonus to frozen targets.<br/><Bullet/> No effect on burning foes."

[MZFreezeProtocol X2AbilityTemplate]
LocFriendlyName="Snapfreeze Protocol"
LocLongDescription="Send the GREMLIN to dump concentrated bitterfrost on a single foe, immediatly freezing them."
LocHelpText="Send the GREMLIN to dump concentrated bitterfrost on a single foe, immediatly freezing them."
LocFlyOverText="Snapfreeze Protocol"
LocPromotionPopupText="<Bullet/> One use per battle. <br/><Bullet/> Requires a successful Hack vs Hack Defense roll."

[MZFreezeWeapon X2AbilityTemplate]
LocFriendlyName="Freeze Weapon"
LocHelpText="Disable a target's weapon by freezing it. Inflicts bitterfrost."
LocLongDescription="Disable a target's weapon by freezing it. Inflicts bitterfrost."
LocFlyOverText="Freeze Weapon"
LocMissMessage="Freeze Weapon resisted!"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZFreezingField X2AbilityTemplate]
LocFriendlyName="Freezing Field"
LocLongDescription="Open a frigid rift that chills any units caught in its radius. After one turn, it snaps shut freezing and damaging those foolish enough to remain within."
LocHelpText="Open a frigid rift that chills any units caught in its radius. After one turn, it snaps shut freezing and damaging those foolish enough to remain within."
LocFlyOverText="Freezing Field"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."
[MZFreezingFieldStage2 X2AbilityTemplate]
LocFriendlyName="Freezing Field"
LocFlyOverText="Freezing Field"

[MZFreezingSpear X2AbilityTemplate]
LocFriendlyName="Freezing Spear"
LocLongDescription="Fire a freezing round in a line, dealing cold damage and inflicting bitterfrost on multiple targets."
LocHelpText="Fire a freezing round in a line, dealing cold damage and inflicting bitterfrost on multiple targets."
LocFlyOverText="Freezing Spear"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZFreezingSphere X2AbilityTemplate]
LocFriendlyName="Freezing Sphere"
LocLongDescription="Hurl a ball of ice that explodes on impact, dealing cold damage and inflicting bitterfrost to multiple targets."
LocHelpText="Hurl a ball of ice that explodes on impact, dealing cold damage and inflicting bitterfrost to multiple targets."
LocFlyOverText="Freezing Sphere"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZFrigidWhisper X2AbilityTemplate]
LocFriendlyName="Frigid Whisper"
LocLongDescription="Free Action. Send forth a frigid thought, chilling a vulnerable mind."
LocHelpText="Free Action. Send forth a frigid thought, chilling a vulnerable mind."
LocFlyOverText="Frigid Whisper"
LocPromotionPopupText="<Bullet/> Cannot be used on targets immune to mental effects.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZFrostbite X2AbilityTemplate]
LocFriendlyName="Frostbite"
LocLongDescription="A freezing cold blast inflicts rupture and damage over time depending on how chilled the target is."
LocHelpText="A freezing cold blast inflicts rupture and damage over time depending on how chilled the target is."
LocFlyOverText="Frostbite"
LocPromotionPopupText="<Bullet/> Rupture increases the damage the target takes from all subsequent attacks. <br/><Bullet/> Rupture scales from 1 (no chill effects) to 4 (frozen).<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZFrostBullet X2AbilityTemplate]
LocFriendlyName="Frost Bullet"
LocLongDescription="Bullet Art: Inflicts cold damage and bitterfrost."
LocHelpText="Bullet Art: Inflicts cold damage and bitterfrost."
LocFlyOverText="Frost Bullet"
LocPromotionPopupText="<Bullet/> Has <Ability:SelfCharges/> charges.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."
[MZFrostBulletX X2AbilityTemplate]
LocFriendlyName="Painful Chill"
LocLongDescription="Frost Bullet also inflicts Hypothermia, dealing damage over time depending on how chilled the targets are."
LocHelpText="Frost Bullet also inflicts Hypothermia, dealing damage over time depending on how chilled the targets are."
LocFlyOverText="Painful Chill"
LocPromotionPopupText="<Bullet/> Damage from Hypothermia is maximized against Frozen targets."

[MZFrostFusil X2AbilityTemplate]
LocFriendlyName="Frost Fusil"
LocLongDescription="Costs <Ability:SelfManaCost/> Mana. Fire a pistol shot that does additional cold damage and inflicts bitterfrost."
LocHelpText="Costs <Ability:SelfManaCost/> Mana. Fire a pistol shot that does additional cold damage and inflicts bitterfrost."
LocFlyOverText="Frost Fusil"
LocPromotionPopupText="<Bullet/> Costs <Ability:SelfManaCost/> Mana.<br/><Bullet/> Deals an additional <Ability:MZAddElemTargetDamageDLC/> of the weapon's base damage as cold damage.<br/><Bullet/> Inate shred and pierce are also increased by the same amount."

[MZFrostKnife X2AbilityTemplate]
LocFriendlyName="Ice Fang"
LocLongDescription="Stab an adjacent foe, dealing cold damage and inflicting bitterfrost and hypothermia."
LocHelpText="Stab an adjacent foe, dealing cold damage and inflicting bitterfrost and hypothermia."
LocFlyOverText="Ice Fang"
LocPromotionPopupText="<Bullet/> Bitterfrost cripples mobility and dodge, and with enough applications Freezes the target.<br/><Bullet/> Hypothermia is a DoT that the damage depends on the severity of bitterfrost the target is suffering from.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZFrostProtocol X2AbilityTemplate]
LocFriendlyName="Frost Protocol"
LocLongDescription="Send the GREMLIN to inflict low gaurenteed cold damage and bitterfrost."
LocHelpText="Send the GREMLIN to inflict low gaurenteed cold damage and bitterfrost."
LocFlyOverText="Frost Protocol"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZFrostRuneshot X2AbilityTemplate]
LocFriendlyName="Frost Runeshot"
LocLongDescription="Costs <Ability:SelfManaCost/> Mana. Fire a shot that does additional cold damage and inflicts bitterfrost."
LocHelpText="Costs <Ability:SelfManaCost/> Mana. Fire a shot that does additional cold damage and inflicts bitterfrost."
LocFlyOverText="Frost Runeshot"
LocPromotionPopupText="<Bullet/> Costs <Ability:SelfManaCost/> Mana.<br/><Bullet/> Deals an additional <Ability:MZAddElemTargetDamageDLC/> of the weapon's base damage as cold damage.<br/><Bullet/> Inate shred and pierce are also increased by the same amount."

[MZFrostSabre X2AbilityTemplate]
LocFriendlyName="Frost Sabre"
LocLongDescription="Costs <Ability:SelfManaCost/> Mana. Slash any enemy within movement range. Does additional cold damage and inflicts bitterfrost."
LocHelpText="Costs <Ability:SelfManaCost/> Mana. Slash any enemy within movement range. Does additional cold damage and inflicts bitterfrost."
LocFlyOverText="Frost Sabre"
LocPromotionPopupText="<Bullet/> Costs <Ability:SelfManaCost/> Mana.<br/><Bullet/> Deals an additional <Ability:MZAddElemTargetDamageDLC/> of the weapon's base damage as cold damage.<br/><Bullet/> The bonus damage and pierce from Double Grip is also increased.<br/><Bullet/> Inate shred and pierce are also increased by the same amount."

[MZFrozenAbyss X2AbilityTemplate]
LocFriendlyName="Frozen Abyss"
LocLongDescription="Consume <Ability:SelfPercentHealthCost/> HP to create a freezing abyss that will consume the lives of those that remain within at the start of the <Ability:CLASSNAME/>'s next turn."
LocHelpText="Consume <Ability:SelfPercentHealthCost/> HP to create a freezing abyss that will consume the lives of those that remain within at the start of the <Ability:CLASSNAME/>'s next turn."
LocFlyOverText="Frozen Abyss"
LocPromotionPopupText="<Bullet/> Initialy does low cold damage and applies bitterfrost.<br/><Bullet/> On the next turn, does massive cold damage which steals health.<br/><Bullet/> The efficency of life stealing increases when the caster is low on health. <br/><Bullet/> When the abyss collapses, it will also leave behind a curse cloud.<br/><Bullet/> Due to the high HP cost and delay before most of the damage, this can be a dangerous ability to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."
[MZFrozenAbyssStage2 X2AbilityTemplate]
LocFriendlyName="Frozen Abyss"
LocFlyOverText="Frozen Abyss"

[MZGeoSkyPaired X2AbilityTemplate]
LocFriendlyName="Geomancy: Open Sky"
LocLongDescription="Gain two geomancy abilities. Raging Sky for the Urban biome, and Mist Storm for the Temperate biome."
LocHelpText="Gain two geomancy abilities. Raging Sky for the Urban biome, and Mist Storm for the Temperate Biome."
LocFlyOverText="Geomancy: Open Sky"

[MZGeoTempPaired X2AbilityTemplate]
LocFriendlyName="Geomancy: Extreme Tempetures"
LocLongDescription="Gain two geomancy abilities. Shining Flare for the Arid biome, and Avalanche for the Tundra biome."
LocHelpText="Gain two geomancy abilities. Shining Flare for the Arid biome, and Avalanche for the Tundra biome."
LocFlyOverText="Geomancy: Extreme Tempetures"

[MZGeoDarkPaired X2AbilityTemplate]
LocFriendlyName="Geomancy: Dark Places"
LocLongDescription="Gain two geomancy abilities. Rockfall for the Underground biome, and Venom Squall for the Xenoform biome."
LocHelpText="Gain two geomancy abilities. Rockfall for the Underground biome, and Venom Squall for the Xenoform biome."
LocFlyOverText="Geomancy: Dark Places"

[MZGlacialSpike X2AbilityTemplate]
LocFriendlyName="Glacial Spike"
LocLongDescription="Raise a pillar of ice. Enemies in the vicinity suffer cold damage and bitterchill"
LocHelpText="Raise a pillar of ice. Enemies in the vicinity suffer cold damage and bitterchill"
LocFlyOverText="Glacial Spike"
LocPromotionPopupText="<Bullet/> The pillar can be used as full cover.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZGlacialTomb X2AbilityTemplate]
LocFriendlyName="Glacial Tomb"
LocLongDescription="Once per battle, imprision a foe in a block of ice. Even works against foes typically immune to cold damage."
LocHelpText="Once per battle, imprision a foe in a block of ice. Even works against foes typically immune to cold damage."
LocFlyOverText="Glacial Tomb"
LocPromotionPopupText="<Bullet/> Can be used once per battle. <br/><Bullet/> Uses the Bind damage type instead of Cold, so it remains effective on foes that would normally be immune to freeze."

[MZHeatDrain X2AbilityTemplate]
LocFriendlyName="Heat Drain"
LocLongDescription="Drain heat from a foe, chilling them and restoring the caster's health. Consume burning to do increased damage."
LocHelpText="Drain heat from a foe, chilling them and restoring the caster's health. Consume burning to do increased damage."
LocFlyOverText="Heat Drain"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZHoarfrostBlade X2AbilityTemplate]
LocFriendlyName="Hoarfrost Blade"
LocLongDescription="Strike twice at the target with a frozen blade of ice. Inflicts Bitterfrost."
LocHelpText="Strike twice at the target with a frozen blade of ice. Inflicts Bitterfrost."
LocFlyOverText="Hoarfrost Blade"
LocPromotionPopupText="<Bullet/> Has <Ability:SelfCharges/> uses per battle.<br/><Bullet/> Shares Charges with other Parivir Blades, but has more total charges if more blades are learned."

[MZIcebreaker X2AbilityTemplate]
LocFriendlyName="Icebreaker"
LocLongDescription="Smash a frozen foe, dealing severe critical damage. The broken ice shards will also damage foes in a cone behind them."
LocHelpText="Smash a frozen foe, dealing severe critical damage. The broken ice shards will also damage foes in a cone behind them."
LocFlyOverText="Icebreaker"
LocPromotionPopupText="<Bullet/> Can only be used on a Frozen foe, and will consume all frost debuffs. <br/><Bullet/> Always hits and automatically crits.<br/><Bullet/> Deals two hits to the primary target, but only one hit to multitargets.<br/><Bullet/> Applies bitterfrost to multitargets.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZIceDragonBreath X2AbilityTemplate]
LocFriendlyName="Ice Dragon Breath"
LocLongDescription="Breathe frost in a cone in front of the user. Deals cold damage and inflicts bitterfrost."
LocHelpText="Breathe frost in a cone in front of the user. Deals cold damage and inflicts bitterfrost."
LocFlyOverText="Ice Dragon Breath"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Shares a cooldown with other dragon breaths.<br/><Bullet/> Each additional dragon breath learned reduces the shared cooldown by 1."

[MZIcyBurst X2AbilityTemplate]
LocFriendlyName="Icy Burst"
LocLongDescription="Fire a steadied burst of freezing rounds. Two consecutive shots that do cold damage and inflict bitterfrost."
LocHelpText="Fire two consecutive shots that do cold damage and inflict bitterfrost."
LocFlyOverText="Icy Burst"
LocPromotionPopupText="<Bullet/> Requires 2 actions and 3 ammo to fire.<br/><Bullet/> Each shot inflicts a stack of bitterfrost, so it will apply 2 stacks if both shots connect.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."
[MZIcyBurst2 X2AbilityTemplate]
LocFriendlyName="Icy Burst"
LocFlyOverText="Icy Burst"

[MZJetPunchCombo X2AbilityTemplate]
LocFriendlyName="Jet Punch Combo"
LocLongDescription="Jet Pack Punch and Slam attacks no longer end the turn."
LocHelpText="Jet Pack Punch and Slam attacks no longer end the turn."
LocFlyOverText="Jet Punch Combo"

[MZLavaAxe X2AbilityTemplate]
LocFriendlyName="Lava Axe"
LocHelpText="Throw a volcanic axe at a target. Deals fire damage and inflicts burning."
LocLongDescription="Throw a volcanic axe at a target. Deals fire damage and inflicts burning."
LocFlyOverText="Lava Axe"
LocPromotionPopupText="<Bullet/> This attack does not automatically end the turn.<br/><Bullet/> Shares a cooldown with other elemental axe throws.<br/><Bullet/> The cooldown is reduced the more elemental axe throws the <Ability:CLASSNAME/> has learned.<br/><Bullet/> Has a base <Ability:SELFCOOLDOWN/> turn cooldown."

[MZMistStorm X2AbilityTemplate]
LocFriendlyName="Mist Storm"
LocLongDescription="Draw upon the power of the Mist, inflicting blind and psionic damage in a target area."
LocHelpText="Draw upon the power of the Mist, inflicting blind and psionic damage in a target area."
LocFlyOverText="Mist Strom"
LocPromotionPopupText="<Bullet/> Can only be used in the TEMPERATE Biome.<br/><Bullet/> Deals psionic damage and inflicts blind on enemies in a small area.<br/><Bullet/> Also reduces will and hack defense of it's victims.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZNaturesEmbrace X2AbilityTemplate]
LocFriendlyName="Nature's Embrace"
LocLongDescription="Draw upon the power of nature to attack a single enemy. Causes additional effects depending on the biome."
LocHelpText="Draw upon the power of nature to attack a single enemy. Causes additional effects depending on the biome."
LocFlyOverText="Nature's Embrace"
LocPromotionPopupText="<Bullet/> In TUNDRA biome: Inflicts bitterfrost.<br/><Bullet/> In TEMPERATE biome: Inflicts blind. <br/><Bullet/> In ARID biome: Inflicts burning. <br/><Bullet/> In URBAN Biome: Inflicts knockback. <br/><Bullet/> UNDERGROUND: Hits twice. <br/><Bullet/> In XENOFORM biome: Inflicts poison and zombify.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZNaturesWrath X2AbilityTemplate]
LocFriendlyName="Nature's Wrath"
LocLongDescription="Nature's Embrace no longer has a cooldown. Geomancy abilities gain critical chance and damage based on the number learned."
LocHelpText="Nature's Embrace no longer has a cooldown. Geomancy abilities gain critical chance and damage based on the number learned."
LocFlyOverText="Nature's Wrath"
LocPromotionPopupText="<Bullet/>Nature's Embrace no longer has a cooldown.<br/><Bullet/> Geomancy ability gain <Ability:NatureWrathCRITCHANCE/>% critical chance per geomancy ability learned.<br/><Bullet/> Geomancy ability gain +<Ability:NatureWrathCRITDAMAGE/> critical damage per geomancy ability learned."

[MZPiercingCold X2AbilityTemplate]
LocFriendlyName="Piercing Cold"
LocLongDescription="Attacks against chilled foes pierce armour. Effectiveness increases with chill tier."
LocHelpText="Attacks against chilled foes pierce armour. Effectiveness increases with chill tier."
LocFlyOverText="Piercing Cold"

[MZPolarRay X2AbilityTemplate]
LocFriendlyName="Polar Ray"
LocLongDescription="Project a beam of frigid power that damages every target it passes through. This attack can penetrate multiple enemies and obstacles."
LocHelpText="Project a beam of polar energy that damages and chills every target it passes through."
LocFlyOverText="Polar Ray"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZRestedWings X2AbilityTemplate]
LocFriendlyName="Rested Wings"
LocLongDescription="Recover Jet Shot charges when hunkering down. Recover a Flight charge on kill during Jet Shot."
LocHelpText="Recover Jet Shot charges when hunkering down. Recover a Flight charge on kill during Jet Shot."
LocFlyOverText="Rested Wings"

[MZRockfall X2AbilityTemplate]
LocFriendlyName="Rockfall"
LocLongDescription="Draw upon the power of the Underground, and pummel a target area with heavy damage."
LocHelpText="Draw upon the power of the Underground, and pummel a target area with heavy damage."
LocFlyOverText="Rockfall"
LocPromotionPopupText="<Bullet/> Can only be used in the UNDERGROUND Biome.<br/><Bullet/> Deals two hits of melee damage to enemies in a small area.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZSeismicShift X2AbilityTemplate]
LocFriendlyName="Seismic Shift"
LocLongDescription="Teleport to a new location and unleash the power of nature on foes there. Causes additional effects depending on the biome."
LocHelpText="Teleport to a new location and unleash the power of nature on foes there. Causes additional effects depending on the biome."
LocFlyOverText="Seismic Shift"
LocPromotionPopupText="<Bullet/> In TUNDRA biome: Inflicts bitterfrost.<br/><Bullet/> In TEMPERATE biome: Inflicts blind. <br/><Bullet/> In ARID biome: Inflicts burning. <br/><Bullet/> In URBAN Biome: Inflicts knockback. <br/><Bullet/> UNDERGROUND: Hits twice. <br/><Bullet/> In XENOFORM biome: Inflicts poison and zombify.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZShatter X2AbilityTemplate]
LocFriendlyName="Shatter"
LocLongDescription="Detonate a frozen foe, freeing them from the ice but dealing severe damage in an area around them."
LocHelpText="Detonate a frozen foe, freeing them from the ice but dealing severe damage in an area around them."
LocFlyOverText="Shatter"
LocPromotionPopupText="<Bullet/> Can only be used on a Frozen foe, and will consume all frost debuffs.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZShatterShot X2AbilityTemplate]
LocFriendlyName="Shattershot"
LocLongDescription="A carefully aimed shot detonates the ice on a frozen foe, dealing severe critical damage. Also damages foes in an area around the target."
LocHelpText="A carefully aimed shot detonates the ice on a frozen foe, dealing severe critical damage. Also damages foes in an area around the target."
LocFlyOverText="Shattershot"
LocPromotionPopupText="<Bullet/> Can only be used on a Frozen foe, and will consume all frost debuffs.<br/><Bullet/> Always hits and automatically crits.<br/><Bullet/> Deals two hits to the primary target, but only one hit to multitargets.<br/><Bullet/> Applies bitterfrost to multitargets.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZShiningFlare X2AbilityTemplate]
LocFriendlyName="Shining Flare"
LocLongDescription="Draw upon the power of the Desert, inflicting fire damage and burning in a target area."
LocHelpText="Draw upon the power of the Desert, inflicting fire damage and burning in a target area."
LocFlyOverText="Shining Flare"
LocPromotionPopupText="<Bullet/> Can only be used in the ARID Biome.<br/><Bullet/> Deals fire damage and inflicts burning on enemies in a small area.<br/><Bullet/> Also sets fire to the enviroment<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZShiver X2AbilityTemplate]
LocFriendlyName="Shiver"
LocLongDescription="Damaging <Ability:WEAPONNAME/> attacks have a <Ability:MZSHIVERCHANCE/> chance to inflict bitterfrost."
LocHelpText="Damaging <Ability:WEAPONNAME/> attacks have a <Ability:MZSHIVERCHANCE/> chance to inflict bitterfrost."
LocFlyOverText="Shiver"
[MZApplyShiver X2AbilityTemplate]
LocFriendlyName="Shiver"
LocFlyOverText="Shiver"

[MZShiverOnCrit X2AbilityTemplate]
LocFriendlyName="Chilling Critical"
LocLongDescription="Damaging <Ability:WEAPONNAME/> attacks that critcaly hit have a <Ability:MZSHIVERONCRITCHANCE/> chance to inflict bitterfrost."
LocHelpText="Damaging <Ability:WEAPONNAME/> attacks that critcaly hit have a <Ability:MZSHIVERONCRITCHANCE/> chance to inflict bitterfrost."
LocFlyOverText="Chilling Critical"

[MZShiverSuppress X2AbilityTemplate]
LocFriendlyName="Chilling Suppression"
LocLongDescription="Suppression abilities have a <Ability:MZSHIVERSUPPRESSCHANCE/> chance to inflict bitterfrost."
LocHelpText="Suppression abilities have a <Ability:MZSHIVERSUPPRESSCHANCE/> chance to inflict bitterfrost."
LocFlyOverText="Chilling Suppression"

[MZSlingBlade X2AbilityTemplate]
LocFriendlyName="Sling Blade"
LocHelpText="Throw an axe at a target. This attack does not automatically end the turn."
LocLongDescription="Throw an axe at a target. This attack does not automatically end the turn."
LocFlyOverText="Sling Blade"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZSliprain X2AbilityTemplate]
LocFriendlyName="Sliprain"
LocLongDescription="Drench the target with driving rain. Deals cold damage and bitterfrosts target."
LocHelpText="Drench the target with driving rain. Deals cold damage and bitterfrosts target."
LocFlyOverText="Sliprain"
LocPromotionPopupText="<Bullet/> Uses a mental attack roll, but mental immunity will not protect against it.<br/><Bullet/> This makes it very easy to hit robotic foes, which typically have extremely low will.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZSnowflakeDraft X2AbilityTemplate]
LocFriendlyName="Snowflake Draft"
LocLongDescription="Charge a location and assault all foes with a freezing blade. Deals cold damage and inflicts bitterfrost."
LocHelpText="Charge a location and assault all foes with a freezing blade. Deals cold damage and inflicts bitterfrost."
LocFlyOverText="Snowflake Draft"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZStormHammer X2AbilityTemplate]
LocFriendlyName="Storm Hammer"
LocHelpText="Throw an electrified axe at a target. Deals electric damage and inflicts disorient."
LocLongDescription="Throw an electrified axe at a target. Deals electric damage and inflicts disorient."
LocFlyOverText="Storm Hammer"
LocPromotionPopupText="<Bullet/> This attack does not automatically end the turn.<br/><Bullet/> Shares a cooldown with other elemental axe throws.<br/><Bullet/> The cooldown is reduced the more elemental axe throws the <Ability:CLASSNAME/> has learned.<br/><Bullet/> Has a base <Ability:SELFCOOLDOWN/> turn cooldown."

[MZSuperColdStorage X2AbilityTemplate]
LocFriendlyName="Supercooled Storage"
LocLongDescription="The GREMLIN's bitterfrost tank is kept compressed at even lower tempetures, granting bonus charges to Freeze and Winter Protocols."
LocHelpText="The GREMLIN's bitterfrost tank is kept compressed at even lower tempetures, granting bonus charges to Freeze and Winter Protocols."
LocFlyOverText="Supercooled Storage"

[MZTeineiWind X2AbilityTemplate]
LocFriendlyName="Teinei's Wind"
LocLongDescription="Assault a large area with freezing winds. Deals cold damage and inflicts bitterfrost. Consumes burning to do increased damage."
LocHelpText="Assault a large area with freezing winds. Deals cold damage and inflicts bitterfrost. Consumes burning to do increased damage."
LocFlyOverText="Teinei's Wind"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZUltimaShot X2AbilityTemplate]
LocFriendlyName="Ultima Shot"
LocLongDescription="Derived from the most powerful of magicks. During Jet Shot, fire a powerful shot by expending <Ability:ULTIMAJETSHOTCOST/> Jet Shot charges."
LocHelpText="Derived from the most powerful of magicks. During Jet Shot, fire a powerful shot by expending <Ability:ULTIMAJETSHOTCOST/> Jet Shot charges."
LocFlyOverText="Ultima Shot"
LocPromotionPopupText="<Bullet/> Must have Jet Shot active in order to use.<br/><Bullet/> Requires and consumes <Ability:ULTIMAJETSHOTCOST/> Jet Shot charges.<br/><Bullet/> Hits up to three times."

[MZVapourBlade X2AbilityTemplate]
LocFriendlyName="Vapour Blade"
LocHelpText="Throw a frozen axe at a target. Deals cold damage and inflicts bitterfrost."
LocLongDescription="Throw a frozen axe at a target. Deals cold damage and inflicts bitterfrost."
LocFlyOverText="Vapour Blade"
LocPromotionPopupText="<Bullet/> This attack does not automatically end the turn.<br/><Bullet/> Shares a cooldown with other elemental axe throws.<br/><Bullet/> The cooldown is reduced the more elemental axe throws the <Ability:CLASSNAME/> has learned.<br/><Bullet/> Has a base <Ability:SELFCOOLDOWN/> turn cooldown."

[MZVeinFreeze X2AbilityTemplate]
LocFriendlyName="Vein Freeze"
LocLongDescription="Consume <Ability:SelfHealthCost/> HP to freeze a living foe solid."
LocHelpText="Consume <Ability:SelfHealthCost/> HP to freeze a living foe solid."
LocFlyOverText="Vein Freeze"
LocPromotionPopupText="<Bullet/> Has a steep health cost, but no use limits or cooldown.<br/><Bullet/> Cannot be used on robotic foes, or targets immune to cold."

[MZVenomSquall X2AbilityTemplate]
LocFriendlyName="Venom Squall"
LocLongDescription="Invoke nature's wrath against Alien blight, and inflict heavy poison damage in a target area. Creates a poison cloud."
LocHelpText="Invoke nature's wrath against Alien blight, and inflict heavy poison damage in a target area. Creates a poison cloud."
LocFlyOverText="Venom Squall"
LocPromotionPopupText="<Bullet/> Can only be used in the XENOFORM Biome.<br/><Bullet/> Deals poison damage and inflicts poisoned and zombified on enemies in a small area.<br/><Bullet/> Also creates a poison cloud.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

[MZViciousFalcon X2AbilityTemplate]
LocFriendlyName="Vicious Falcon"
LocLongDescription="Do more damage with Jet Punch and Slam abilies, or during Jet Shot."
LocHelpText="Do more damage with Jet Punch and Slam abilies, or during Jet Shot."
LocFlyOverText="Vicious Falcon"

[MZVulnFrost X2AbilityTemplate]
LocFriendlyName="Frost Vulnerability"
LocLongDescription="Frost damage taken is increased."
LocHelpText="Frost damage taken is increased."
LocFlyOverText="Frost Vulnerability"

[MZWinterProtocol X2AbilityTemplate]
LocFriendlyName="Winter Protocol"
LocLongDescription="Send the GREMLIN to deliver a cryogenic explosive. Deals cold damage and inflicts bitterfrost."
LocHelpText="Send the GREMLIN to deliver a cryogenic explosive. Deals cold damage and inflicts bitterfrost."
LocFlyOverText="Winter Protocol"
LocPromotionPopupText="<Bullet/> Has <Ability:SelfCharges/> uses per battle."

[MZWhiteoutProtocol X2AbilityTemplate]
LocFriendlyName="Whiteout Protocol"
LocLongDescription="Send the GREMLIN to deliver a frigid mist that inflicts both blind and bitterfrost in a large area."
LocHelpText="Send the GREMLIN to deliver a frigid mist that inflicts both blind and bitterfrost in a large area."
LocFlyOverText="Whiteout Protocol"
LocPromotionPopupText="<Bullet/> While both effects are only soft control, the combination can render distant foes helpless.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown."

